In [1]:
# Please change the myid as your UserID assigned
#
myid='1'
%load_ext sql
mypass = "mysql+mysqlconnector://myuser{myid}:Password#1234@10.0.1.29/airportdb".replace("{myid}", myid)
%sql  $mypass

In [2]:
myoutput = %sql select 1;
display(myoutput)
myoutput = %sql show databases;
display(myoutput)

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.

[(1,)]

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
4 rows affected.

[('airportdb',), ('information_schema',), ('mydb1',), ('performance_schema',)]

In [3]:
%%sql
show create table weatherdata;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.

[('weatherdata', "CREATE TABLE `weatherdata` (\n  `log_date` date NOT NULL,\n  `time` time NOT NULL,\n  `station` int NOT NULL,\n  `temp` decimal(3,1) NOT NULL,\n  `hu ... (525 characters truncated) ... lfgang Gassler is licensed under CC BY 4.0. To view a copy of this license, visit https://creativecommons.org/licenses/by/4.0' SECONDARY_ENGINE=RAPID")]

In [4]:
%%time
# %sql ALTER TABLE weatherdata secondary_load;
%sql select @mytime := sysdate();  
%time myoutput = %sql select /*+ SET_VAR(use_secondary_engine=ON) */ log_date, count(*) from weatherdata where log_date > DATE '2005-01-01' group by log_date order by log_date;
display(myoutput.DataFrame().tail(10))
myoutput = %sql select timediff(sysdate(), @mytime);
display(myoutput)
%sql select @mytime := sysdate();
%time myoutput = %sql select /*+ SET_VAR(use_secondary_engine=OFF) */ log_date, count(*) from weatherdata where log_date > DATE '2005-01-01' group by log_date order by log_date;
display(myoutput.DataFrame().tail(10))
myoutput = %sql select timediff(sysdate(), @mytime);
display(myoutput)

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.
 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
4015 rows affected.
CPU times: user 56.6 ms, sys: 435 µs, total: 57 ms
Wall time: 991 ms

        log_date  count(*)
4005  2015-12-21      1152
4006  2015-12-22      1152
4007  2015-12-23      1152
4008  2015-12-24      1152
4009  2015-12-25      1152
4010  2015-12-26      1152
4011  2015-12-27      1152
4012  2015-12-28      1152
4013  2015-12-29      1152
4014  2015-12-30      1152

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.

[(datetime.timedelta(seconds=1),)]

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.
 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
4015 rows affected.
CPU times: user 11.3 ms, sys: 208 µs, total: 11.5 ms
Wall time: 940 ms

        log_date  count(*)
4005  2015-12-21      1152
4006  2015-12-22      1152
4007  2015-12-23      1152
4008  2015-12-24      1152
4009  2015-12-25      1152
4010  2015-12-26      1152
4011  2015-12-27      1152
4012  2015-12-28      1152
4013  2015-12-29      1152
4014  2015-12-30      1152

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.

[(datetime.timedelta(seconds=1),)]

CPU times: user 89.4 ms, sys: 4.71 ms, total: 94.1 ms
Wall time: 1.96 s

In [5]:
%%sql
explain select count(*) from weatherdata where log_date > DATE '2005-01-01'group by log_date order by log_date;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
1 rows affected.

[(1, 'SIMPLE', 'weatherdata', None, 'range', 'PRIMARY', 'PRIMARY', '3', None, 2304667, 100.0, 'Using where; Using index')]

In [6]:

%%sql
set autocommit=true;
EXPLAIN SELECT
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
1 rows affected.

[(1, 'NONE', None, None, None, None, None, None, None, None, None, 'Using secondary engine RAPID. Use EXPLAIN FORMAT=TREE to show the plan.')]

In [7]:

%%sql
set autocommit=false;
EXPLAIN SELECT
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
4 rows affected.

[(1, 'SIMPLE', 'passengerdetails', None, 'ALL', 'PRIMARY', None, None, None, 36271, 30.0, 'Using where; Using temporary; Using filesort'),
 (1, 'SIMPLE', 'booking', None, 'ref', 'seatplan_unq,flight_idx,passenger_idx', 'passenger_idx', '4', 'airportdb.passengerdetails.passenger_id', 682, 100.0, None),
 (1, 'SIMPLE', 'flight', None, 'eq_ref', 'PRIMARY,airline_idx', 'PRIMARY', '4', 'airportdb.booking.flight_id', 1, 100.0, None),
 (1, 'SIMPLE', 'airline', None, 'eq_ref', 'PRIMARY', 'PRIMARY', '2', 'airportdb.flight.airline_id', 1, 100.0, None)]

   mysql+mysqlconnector://admin:***@10.0.1.47/airportdb
 * mysql+mysqlconnector://myuser1:***@10.0.1.47/airportdb
   mysql+mysqlconnector://myuser2:***@10.0.1.47/airportdb
1 rows affected.

[('autocommit', 'OFF')]

In [8]:
%%time
%%sql
set autocommit=true;
SELECT /*+ SET_VAR(use_secondary_engine=FORCED) */
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
10 rows affected.
CPU times: user 3.83 ms, sys: 660 µs, total: 4.49 ms
Wall time: 187 ms

[('Afghanistan Airlines', Decimal('45.92607116'), 20570),
 ('Albania Airlines', Decimal('46.02480595'), 21804),
 ('American Samoa Airli', Decimal('46.10093492'), 15249),
 ('Angola Airlines', Decimal('45.97209191'), 18539),
 ('Argentina Airlines', Decimal('46.03110048'), 21298),
 ('Australia Airlines', Decimal('46.07920841'), 19986),
 ('Azerbaijan Airlines', Decimal('46.01654847'), 16011),
 ('Bahamas Airlines', Decimal('46.22537506'), 22564),
 ('Belarus Airlines', Decimal('46.10813567'), 18226),
 ('Bhutan Airlines', Decimal('46.13247687'), 22873)]

In [9]:
%%time
%%sql
set autocommit=true;
SELECT /*+ SET_VAR(use_secondary_engine=OFF) */
airline.airlinename,
AVG(datediff(departure,birthdate)/365.25) as avg_age,
count(*) as nb_people
FROM
    booking, flight, airline, passengerdetails
WHERE
    booking.flight_id=flight.flight_id AND
    airline.airline_id=flight.airline_id AND
    booking.passenger_id=passengerdetails.passenger_id AND
    country IN ("SWITZERLAND", "FRANCE", "ITALY")
GROUP BY
    airline.airlinename
ORDER BY
    airline.airlinename, avg_age
LIMIT 10;

 * mysql+mysqlconnector://myuser1:***@10.0.1.29/airportdb
0 rows affected.
10 rows affected.
CPU times: user 4.61 ms, sys: 1.21 ms, total: 5.81 ms
Wall time: 14 s

[('Afghanistan Airlines', Decimal('45.92612137'), 20570),
 ('Albania Airlines', Decimal('46.02485633'), 21804),
 ('American Samoa Airli', Decimal('46.10098466'), 15249),
 ('Angola Airlines', Decimal('45.97214161'), 18539),
 ('Argentina Airlines', Decimal('46.03115082'), 21298),
 ('Australia Airlines', Decimal('46.07925759'), 19986),
 ('Azerbaijan Airlines', Decimal('46.01659919'), 16011),
 ('Bahamas Airlines', Decimal('46.22542566'), 22564),
 ('Belarus Airlines', Decimal('46.10818585'), 18226),
 ('Bhutan Airlines', Decimal('46.13252703'), 22873)]